# Pandas DataFrame Oluşturma

In [1]:
import pandas as pd

In [2]:
listA = [4,3,4,2,9,1]

Data frame oluşturuken isimlendiriken columns parametresiyle isimlendirebiliz.

In [3]:
pd.DataFrame(listA, columns= ["degisken_ismi"])

   degisken_ismi
0              4
1              3
2              4
3              2
4              9
5              1

In [4]:
import numpy as np

In [5]:
listB = np.arange(1,10).reshape((3,3))

In [6]:
pd.DataFrame(listB, columns=["var1", "var2", "var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

## df isimlendirme

In [7]:
df = pd.DataFrame(listB, columns=["var1", "var2", "var3"])

In [8]:
df.columns = ["deg1","deg2","deg3"]

In [9]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

----------
## Birkaç özellik

In [10]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [13]:
df.shape # Kaça kaçlık matris olduğu gösteriyor

(3, 3)

In [14]:
df.size # Eleman sayısı

9

In [15]:
df.ndim # Boyut

2

Eğer pandas dataframe ni değerleri sorgularsak artık numpy array olarak dönecektir.

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [18]:
type(df.values)

numpy.ndarray

-------
head ve taili seri de olduğu gibi dataframe de kullanabiliriz.

In [19]:
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [20]:
df.head(1)

   deg1  deg2  deg3
0     1     2     3

In [21]:
df.tail()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [22]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

## Diğer veri yapılarından da oluşturabiliriz.

In [23]:
a = np.array([1,2,3,4,5,6,7])

In [24]:
pd.DataFrame(a, columns=["array-degisken"])

   array-degisken
0               1
1               2
2               3
3               4
4               5
5               6
6               7

# DataFrame Eleman İşlemleri

In [25]:
import numpy as np
import pandas as pd

In [26]:
a1 = np.random.randint(0,10,size= 5)
a2 = np.random.randint(0,10,size= 5)
a3 = np.random.randint(0,10,size= 5)

In [27]:
dictB = {"var1": a1, "var2": a2, "var3": a3}

In [28]:
dictB

{'var1': array([1, 2, 1, 1, 0]),
 'var2': array([0, 2, 2, 8, 2]),
 'var3': array([4, 3, 1, 5, 4])}

In [29]:
df = pd.DataFrame(dictB)

In [30]:
df

   var1  var2  var3
0     1     0     4
1     2     2     3
2     1     2     1
3     1     8     5
4     0     2     4

In [31]:
df[0:3]

   var1  var2  var3
0     1     0     4
1     2     2     3
2     1     2     1

In [32]:
df.index = ["a","b","c","d","e"]

In [33]:
df

   var1  var2  var3
a     1     0     4
b     2     2     3
c     1     2     1
d     1     8     5
e     0     2     4

In [34]:
df["c":"d"]

   var1  var2  var3
c     1     2     1
d     1     8     5

# Silme işlemi

In [35]:
df.drop("a", axis=0)

   var1  var2  var3
b     2     2     3
c     1     2     1
d     1     8     5
e     0     2     4

In [36]:
df

   var1  var2  var3
a     1     0     4
b     2     2     3
c     1     2     1
d     1     8     5
e     0     2     4

In [37]:
df.drop("a", axis=0, inplace=True)

In [38]:
df

   var1  var2  var3
b     2     2     3
c     1     2     1
d     1     8     5
e     0     2     4

In [39]:
# Fancy İndex ile silmek :)

In [40]:
listA = ["d", "e"]

In [41]:
df.drop(listA, axis=0)

   var1  var2  var3
b     2     2     3
c     1     2     1

# Veri Oluşturmak
## Sutun veya satır

In [42]:
df

   var1  var2  var3
b     2     2     3
c     1     2     1
d     1     8     5
e     0     2     4

In [43]:
# var4 yok oluşturalım

In [44]:
df["var4"] = [1,1,1,1]

In [45]:
df

   var1  var2  var3  var4
b     2     2     3     1
c     1     2     1     1
d     1     8     5     1
e     0     2     4     1

In [46]:
# Elemanlarını vererek oluşturduk :)

In [47]:
df["var5"] = df["var3"] * np.random.randint(1,5)

In [48]:
df

   var1  var2  var3  var4  var5
b     2     2     3     1     6
c     1     2     1     1     2
d     1     8     5     1    10
e     0     2     4     1     8

## Tekrar oluşturduğumuz sutunları silelim

In [49]:
df.drop(["var4","var5"], axis = 1)

   var1  var2  var3
b     2     2     3
c     1     2     1
d     1     8     5
e     0     2     4

In [50]:
df

   var1  var2  var3  var4  var5
b     2     2     3     1     6
c     1     2     1     1     2
d     1     8     5     1    10
e     0     2     4     1     8

In [51]:
df.drop(["var4","var5"], axis = 1, inplace=True)

In [52]:
df

   var1  var2  var3
b     2     2     3
c     1     2     1
d     1     8     5
e     0     2     4